Step 1. Import the necessary libraries

In [1]:
import pandas as pd

Step 2. Import the dataset from this address.
Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")

Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [14]:
baby_names.drop(["Id","Unnamed: 0"], axis = 1, inplace = True)
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

Step 6. Is there more male or female names in the dataset?
there are more females

In [17]:
baby_names["Gender"].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

Step 7. Group the dataset by name and assign to names

In [61]:
names = baby_names.groupby("Name").value_counts()
names

Name    Year  Gender  State  Count
Aaban   2013  M       NY     6        1
        2014  M       NY     6        1
Aadan   2008  M       CA     7        1
                      TX     5        1
        2009  M       CA     6        1
                                     ..
Zyriah  2009  F       TX     5        1
        2011  F       LA     6        1
        2012  F       GA     5        1
        2013  F       TX     7        1
        2014  F       TX     6        1
Name: count, Length: 1016395, dtype: int64

Step 8. How many different names exist in the dataset?

In [30]:
baby_names["Name"].nunique()

17632

Step 9. What is the name with most occurrences?

In [45]:
baby_names["Name"].value_counts().index[0]

'Riley'

Step 10. How many different names have the least occurrences?

In [49]:
baby_names["Name"].value_counts(ascending = False).tail()

Name
Terryn     1
Yanna      1
Zemirah    1
Emmilyn    1
Coalton    1
Name: count, dtype: int64

Step 11. What is the median name occurrence?

In [52]:
baby_names["Name"].value_counts().median()

8.0

Step 12. What is the standard deviation of names?

In [64]:
names.std()

0.0

Step 13. Get a summary with the mean, min, max, std and quartiles.

In [63]:
baby_names.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03